nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/targetHAL_ConfigurationManager.cpp
//
// Copyright (c) 2018 The nanoFramework project contributors
// See LICENSE file in the project root for full license information.
//

#include <nanoHAL.h>
#include <nanoHAL_v2.h>
#include <nanoWeak.h>
#include "Esp32_os.h"
#include "targetHAL_ConfigStorage.h"
#include <target_platform.h>

// NVS parameters for Interface config
#define NVS_NAMESPACE	    "nanoF"


// #define DEBUG_CONFIG        1

// Saves the remaining bundle size for multiple block cert configs
static int32_t savedBundleSize;
static int32_t remainingBundleSize;
static int32_t savedBundleOffset;

#ifdef DEBUG_CONFIG
void PrintBlock(char * pBlock, int bsize)
{
	char * pCurrStart;
	char * pCurrPos;
	char * pCurrEnd;
	char * pCurrEndBlock = pBlock + bsize;

	pCurrStart = pBlock;

	while (pCurrStart <= pCurrEndBlock)
	{
		pCurrPos = pCurrStart;
		pCurrEnd = pCurrStart + 32;

		while (pCurrPos < pCurrEnd && pCurrPos <= pCurrEndBlock)
		{
			ets_printf("%02X ", *pCurrPos);
			pCurrPos++;
		}

		ets_printf(" ");

		pCurrPos = pCurrStart;
		while (pCurrPos < pCurrEnd && pCurrPos <= pCurrEndBlock)
		{
			if (*pCurrPos < 32)
				ets_printf(".");
			else
				ets_printf("%c", *pCurrPos);
			pCurrPos++;
		}
		ets_printf("\n");

		pCurrStart = pCurrEnd;
	}
}
#endif

// initialization of configuration manager
// provided as weak so it can be replaced at target level, if required because of the target implementing the storage with a mechanism other then saving to flash
void ConfigurationManager_Initialize()
{
	memset((void*)&g_TargetConfiguration, 0, sizeof(g_TargetConfiguration));

	Config_Initialise();

	// enumerate the blocks
	ConfigurationManager_EnumerateConfigurationBlocks();
};


int32_t ConfigurationManager_FindConfigurationBlockSize(DeviceConfigurationOption configuration, uint32_t configurationIndex)
{
	uint32_t handle;
	int32_t configSize = 0;

	handle = Config_OpenFile(configuration, configurationIndex, false);
	if (handle != CONFIG_ERROR)
	{
		configSize = Config_FileSize(handle);
#ifdef DEBUG_CONFIG
		ets_printf("Find type %d index %d, length %d\n", (int)configuration, configurationIndex, configSize);
#endif
		Config_CloseFile(handle);
	}

	return configSize;
}

bool ConfigurationManager_GetConfigurationBlockFromStorage(DeviceConfigurationOption configuration, uint32_t configurationIndex, void* configurationBlock, int32_t maxBlockSize)
{
	uint32_t handle;
	uint32_t  readSize = CONFIG_ERROR;

#ifdef DEBUG_CONFIG
	ets_printf("GetConfigFromStorage %d, %d\n", (int)configuration, configurationIndex);
#endif

	handle = Config_OpenFile(configuration, configurationIndex, false);
	if (handle != CONFIG_ERROR)
	{
		readSize = Config_ReadFile(handle, (uint8_t *)configurationBlock, maxBlockSize);

#ifdef DEBUG_CONFIG
		ets_printf("GetConfigFromStorage read %d, %d size %d\n", (int)configuration, configurationIndex, readSize);
#endif

		Config_CloseFile(handle);
	}

	return (readSize != CONFIG_ERROR);
}



// Allocate HAL_CONFIGURATION_NETWORK block if required
void ConfigurationManager_allocate_network(uint32_t configCount)
{
	if (g_TargetConfiguration.NetworkInterfaceConfigs == 0)
	{
		uint32_t sizeOfNetworkInterfaceConfigs = offsetof(HAL_CONFIGURATION_NETWORK, Configs) + configCount * sizeof(HAL_Configuration_NetworkInterface *);
		g_TargetConfiguration.NetworkInterfaceConfigs = (HAL_CONFIGURATION_NETWORK*)platform_malloc(sizeOfNetworkInterfaceConfigs);
		memset((void *)g_TargetConfiguration.NetworkInterfaceConfigs, 0, sizeOfNetworkInterfaceConfigs);
	}
}

// Allocate HAL_CONFIGURATION_WIRELESS80211 block if required
void ConfigurationManager_allocate_wireless(uint32_t configCount)
{
	if (g_TargetConfiguration.Wireless80211Configs == 0)
	{
		uint32_t sizeOfWireless80211Configs = offsetof(HAL_CONFIGURATION_NETWORK_WIRELESS80211, Configs) + configCount * sizeof(HAL_Configuration_Wireless80211 *);
		g_TargetConfiguration.Wireless80211Configs = (HAL_CONFIGURATION_NETWORK_WIRELESS80211*)platform_malloc(sizeOfWireless80211Configs);
		memset((void *)g_TargetConfiguration.Wireless80211Configs, 0, sizeOfWireless80211Configs);
	}
}

void ConfigurationManager_allocate_wirelessAP(uint32_t configCount)
{
	if (g_TargetConfiguration.WirelessAPConfigs == 0)
	{
		uint32_t sizeOfWirelessAPConfigs = offsetof(HAL_CONFIGURATION_NETWORK_WIRELESSAP, Configs) + configCount * sizeof(HAL_Configuration_WirelessAP *);
		g_TargetConfiguration.WirelessAPConfigs = (HAL_CONFIGURATION_NETWORK_WIRELESSAP*)platform_malloc(sizeOfWirelessAPConfigs);
		memset((void *)g_TargetConfiguration.WirelessAPConfigs, 0, sizeOfWirelessAPConfigs);
	}
}

// Allocate HAL_CONFIGURATION_X509_CERTIFICATE block if required
void ConfigurationManager_allocate_certificates(uint32_t certificateCount)
{
	if (g_TargetConfiguration.CertificateStore == 0)
	{
		uint32_t sizeOfX509CertificateStore = offsetof(HAL_CONFIGURATION_X509_CERTIFICATE, Certificates) + certificateCount * sizeof(g_TargetConfiguration.CertificateStore->Certificates[0]);
		g_TargetConfiguration.CertificateStore = (HAL_CONFIGURATION_X509_CERTIFICATE*)platform_malloc(sizeOfX509CertificateStore);
		memset((void *)g_TargetConfiguration.CertificateStore, 0, sizeOfX509CertificateStore);
	}

	// Init pointers to cert bundles to 0 ( not allocated )
	for (uint32_t index = 0; index < certificateCount; index++)
		g_TargetConfiguration.CertificateStore->Certificates[index] = 0;
}

bool StoreConfigBlock(DeviceConfigurationOption configType, uint32_t configurationIndex, void * pConfigBlock, size_t writeSize)
{
	bool result = false;
	uint32_t fileHandle;

	fileHandle = Config_OpenFile(configType, configurationIndex, true);
	if (fileHandle != CONFIG_ERROR)
	{
		result = Config_WriteFile(fileHandle, (uint8_t*)pConfigBlock, writeSize);
#ifdef DEBUG_CONFIG
		ets_printf("store type %d index %d, length %d result %d\n", (int)configType, configurationIndex, writeSize, (int)result);
#endif
		Config_CloseFile(fileHandle);
	}

	return result;
}

// Enumerates the configuration blocks from the configuration flash sector 
// it's implemented with 'weak' attribute so it can be replaced at target level if a different persistance mechanism is used
void ConfigurationManager_EnumerateConfigurationBlocks()
{
	// Fix adapter counts -  will get these from NVS 
	// Still need to do wireless AP
	int networkCount = 3;           // Esp32 has 3 network interfaces, Ethernet, Wireless Station & Wireless APn       
	int wirelessCount = 1;
	int wirelessAPCount = 1;
	int certificateCount = 1;

	// Allocate main structures for each type
	ConfigurationManager_allocate_network(networkCount);
	ConfigurationManager_allocate_wireless(wirelessCount);
	ConfigurationManager_allocate_wirelessAP(wirelessAPCount);
	ConfigurationManager_allocate_certificates(certificateCount);

	// For each network interface allocate Network config if required and load from storage
	for (int configIndex = 0; configIndex < networkCount; configIndex++)
	{
		if (g_TargetConfiguration.NetworkInterfaceConfigs->Configs[configIndex] == 0)
		{
			g_TargetConfiguration.NetworkInterfaceConfigs->Configs[configIndex] = (HAL_Configuration_NetworkInterface*)platform_malloc(sizeof(HAL_Configuration_NetworkInterface));
		}

		if (ConfigurationManager_GetConfigurationBlockFromStorage(
			DeviceConfigurationOption_Network,
			configIndex,
			g_TargetConfiguration.NetworkInterfaceConfigs->Configs[configIndex],
			sizeof(HAL_Configuration_NetworkInterface)
		) == false)
		{
			// No config saved so init default block
			HAL_Configuration_NetworkInterface* configPtr = g_TargetConfiguration.NetworkInterfaceConfigs->Configs[configIndex];
			InitialiseNetworkDefaultConfig(configPtr, configIndex);
			StoreConfigBlock(DeviceConfigurationOption_Network, configIndex, configPtr, sizeof(HAL_Configuration_NetworkInterface));
		}
	}

	g_TargetConfiguration.NetworkInterfaceConfigs->Count = networkCount;

	// For each Wireless interface allocate Wireless config if required and load from storage
	for (int configIndex = 0; configIndex < wirelessCount; configIndex++)
	{
		if (g_TargetConfiguration.Wireless80211Configs->Configs[configIndex] == 0)
		{
			g_TargetConfiguration.Wireless80211Configs->Configs[configIndex] = (HAL_Configuration_Wireless80211*)platform_malloc(sizeof(HAL_Configuration_Wireless80211));
		}
		if (ConfigurationManager_GetConfigurationBlockFromStorage(
			DeviceConfigurationOption_Wireless80211Network,
			configIndex,
			g_TargetConfiguration.Wireless80211Configs->Configs[configIndex],
			sizeof(HAL_Configuration_Wireless80211)
		) == false)
		{
			HAL_Configuration_Wireless80211* configPtr = g_TargetConfiguration.Wireless80211Configs->Configs[configIndex];
			InitialiseWirelessDefaultConfig(configPtr, configIndex);
			StoreConfigBlock(DeviceConfigurationOption_Wireless80211Network, configIndex, configPtr, sizeof(HAL_Configuration_Wireless80211));
		}
	}
	g_TargetConfiguration.Wireless80211Configs->Count = wirelessCount;


	// For each Wireless AP interface allocate Wireless AP config if required and load from storage
	for (int configIndex = 0; configIndex < wirelessAPCount; configIndex++)
	{
		if (g_TargetConfiguration.WirelessAPConfigs->Configs[configIndex] == 0)
		{
			g_TargetConfiguration.WirelessAPConfigs->Configs[configIndex] = (HAL_Configuration_WirelessAP*)platform_malloc(sizeof(HAL_Configuration_WirelessAP));
		}
		if (ConfigurationManager_GetConfigurationBlockFromStorage(
			DeviceConfigurationOption_WirelessNetworkAP,
			configIndex,
			g_TargetConfiguration.WirelessAPConfigs->Configs[configIndex],
			sizeof(HAL_Configuration_WirelessAP)
		) == false)
		{
			HAL_Configuration_WirelessAP* configPtr = g_TargetConfiguration.WirelessAPConfigs->Configs[configIndex];
			InitialiseWirelessAPDefaultConfig(configPtr, configIndex);
			StoreConfigBlock(DeviceConfigurationOption_WirelessNetworkAP, configIndex, configPtr, sizeof(HAL_Configuration_WirelessAP));
		}
	}
	g_TargetConfiguration.WirelessAPConfigs->Count = wirelessCount;

