nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/targetHAL_ConfigurationManager.cpp
	// For each Certificate bundle allocate memory and load from storage
	for (int certificateIndex = 0; certificateIndex < certificateCount; certificateIndex++)
	{
		// Free any existing bundles first, we need to reallocate as bundles are variable size
		if (g_TargetConfiguration.CertificateStore->Certificates[certificateIndex] != 0)
		{
			platform_free(g_TargetConfiguration.CertificateStore->Certificates[certificateIndex]);
			g_TargetConfiguration.CertificateStore->Certificates[certificateIndex] = 0;
		}

		// Find size of saved cert bundle
		int32_t bundleSize = ConfigurationManager_FindConfigurationBlockSize(DeviceConfigurationOption_X509CaRootBundle, certificateIndex);
		if (bundleSize > 0)
		{
			// Bundle exits
			g_TargetConfiguration.CertificateStore->Count = certificateIndex + 1;
			g_TargetConfiguration.CertificateStore->Certificates[certificateIndex] = (HAL_Configuration_X509CaRootBundle*)platform_malloc(bundleSize);
			ConfigurationManager_GetConfigurationBlockFromStorage(DeviceConfigurationOption_X509CaRootBundle, certificateIndex, g_TargetConfiguration.CertificateStore->Certificates[certificateIndex], bundleSize);
		}
	}
}

// Build AP default ssid based on last 3 bytes of MAC addr
// nano_xxxxxx
//
void CreateDefaultApSSID(HAL_Configuration_WirelessAP * pconfig)
{
	uint8_t mac[6];
	esp_efuse_mac_get_default(mac);

	hal_strcpy_s((char *)pconfig->Ssid, sizeof(pconfig->Ssid), "nano_");
	char * pMac = (char*)pconfig->Ssid + 5;
	// Last 3 bytes of MAC address
	for (int index = 3; index < 6; index++)
	{
		sprintf(pMac, "%02X", (int)mac[index]);
		pMac += 2;
	}
}

//  Default initialisation of wireless config blocks for ESP32 targets
void InitialiseWirelessDefaultConfig(HAL_Configuration_Wireless80211 * pconfig, uint32_t configurationIndex)
{
	memset(pconfig, 0, sizeof(HAL_Configuration_Wireless80211));

	// Wireless station
	pconfig->Id = configurationIndex;

	// test default data for AP
	// hal_strcpy_s( (char*)pconfig->Ssid, sizeof(pconfig->Ssid), "MySSID" );
	// hal_strcpy_s( (char*)pconfig->Password, sizeof(pconfig->Password), "MyPassword" );

	// Set default to Auto Connect + Enable + WirelessFlags_SmartConfig so station can be started by default
	// Once smart config has run will start up automatically and reconnect of disconnected
	// Application will have to disable wifi to save power etc
	pconfig->Flags = (WirelessFlags)(WirelessFlags_Auto | WirelessFlags_Enable | WirelessFlags_SmartConfig);
}

//  Default initialisation of wireless config blocks for ESP32 targets
void InitialiseWirelessAPDefaultConfig(HAL_Configuration_WirelessAP * pconfig, uint32_t configurationIndex)
{
	memset(pconfig, 0, sizeof(HAL_Configuration_WirelessAP));

	pconfig->Id = configurationIndex;

	// Build AP default ssid/password based on MAC addr
	// but don't enable by default
	CreateDefaultApSSID(pconfig);

	hal_strcpy_s((char *)pconfig->Password, sizeof(pconfig->Password), "nanoframework");

	pconfig->Authentication = AuthenticationType_WPA2;
	pconfig->Encryption = EncryptionType_WPA2;
	pconfig->Radio = RadioType_802_11n;
	pconfig->Channel = 11;
	pconfig->MaxConnections = 4;

	// Disable Soft AP (default)
	pconfig->Flags = WirelessAPFlags_None;
}

//  Default initialisation of Network interface config blocks for ESP32 targets
bool InitialiseNetworkDefaultConfig(HAL_Configuration_NetworkInterface * pconfig, uint32_t configurationIndex)
{
	memset(pconfig, 0, sizeof(HAL_Configuration_NetworkInterface));

	// make sure the config block marker is set
	memcpy(pconfig->Marker, c_MARKER_CONFIGURATION_NETWORK_V1, sizeof(c_MARKER_CONFIGURATION_NETWORK_V1));

	switch (configurationIndex)
	{
		case 0: // Wireless Station
			pconfig->InterfaceType = NetworkInterfaceType_Wireless80211;
			pconfig->StartupAddressMode = AddressMode_DHCP;
			pconfig->AutomaticDNS = 1;
			pconfig->SpecificConfigId = 0;
			break;

		case 1: // Wireless AP
			pconfig->InterfaceType = NetworkInterfaceType_WirelessAP;
			pconfig->StartupAddressMode = AddressMode_Static;
			pconfig->SpecificConfigId = 0;
			// Set default address 192.168.1.1
			//pconfig->IPv4Address
			//pconfig->IPv4NetMask
		   // pconfig->IPv4GatewayAddress
			break;

		case 2: // Ethernet
			pconfig->InterfaceType = NetworkInterfaceType_Ethernet;
			pconfig->StartupAddressMode = AddressMode_DHCP;
			pconfig->AutomaticDNS = 1;
			break;
	}

	// get default MAC
	esp_efuse_mac_get_default(pconfig->MacAddress);

	// always good
	return TRUE;
}


//
// Get the specified configuration block from global memory ( g_TargetConfiguration )
//
// Parameters:-
//   configurationBlock : Destination to copy configuration data
//   configuration      : Type of configuration block to copy
//   configurationIndex : Index of type to copy
//
// return:-
//    true - OK 
//    false- Error/Not found
//
bool ConfigurationManager_GetConfigurationBlock(void* configurationBlock, DeviceConfigurationOption configuration, uint32_t configurationIndex)
{
	int sizeOfBlock = 0;
	uint8_t* blockAddress = NULL;

#ifdef DEBUG_CONFIG
	ets_printf("GetConfig %d, %d\n", (int)configuration, configurationIndex);
#endif

	// validate if the requested block exists
	if (configuration == DeviceConfigurationOption_Network)
	{
		if (g_TargetConfiguration.NetworkInterfaceConfigs->Count == 0 ||
			(configurationIndex + 1) > g_TargetConfiguration.NetworkInterfaceConfigs->Count)
		{
			// there is no network config blocks, init one with default settings
#ifdef DEBUG_CONFIG
			ets_printf("GetConfig CN exit false\n");
#endif
			return FALSE;
		}

		// set block size
		sizeOfBlock = sizeof(HAL_Configuration_NetworkInterface);

		// get block address
		blockAddress = (uint8_t*)g_TargetConfiguration.NetworkInterfaceConfigs->Configs[configurationIndex];
	}
	else if (configuration == DeviceConfigurationOption_Wireless80211Network)
	{
		if (g_TargetConfiguration.Wireless80211Configs->Count == 0 ||
			(configurationIndex + 1) > g_TargetConfiguration.Wireless80211Configs->Count)
		{
#ifdef DEBUG_CONFIG
			ets_printf("GetConfig WN exit false\n");
#endif
			return FALSE;
		}

		// set block size
		sizeOfBlock = sizeof(HAL_Configuration_Wireless80211);

		// get block address
		blockAddress = (uint8_t*)g_TargetConfiguration.Wireless80211Configs->Configs[configurationIndex];
	}
	else if (configuration == DeviceConfigurationOption_WirelessNetworkAP)
	{
		if (g_TargetConfiguration.WirelessAPConfigs->Count == 0 ||
			(configurationIndex + 1) > g_TargetConfiguration.WirelessAPConfigs->Count)
		{
#ifdef DEBUG_CONFIG
			ets_printf("GetConfig AP exit false\n");
#endif
			return FALSE;
		}

		// set block size
		sizeOfBlock = sizeof(HAL_Configuration_WirelessAP);

		// get block address
		blockAddress = (uint8_t*)g_TargetConfiguration.WirelessAPConfigs->Configs[configurationIndex];
	}
	else if (configuration == DeviceConfigurationOption_X509CaRootBundle)
	{
		if (g_TargetConfiguration.CertificateStore->Count == 0 ||
			(configurationIndex + 1) > g_TargetConfiguration.CertificateStore->Count)
		{
#ifdef DEBUG_CONFIG
			ets_printf("GetConfig XC exit false\n");
#endif
			return FALSE;
		}

		// get block address
		blockAddress = (uint8_t*)g_TargetConfiguration.CertificateStore->Certificates[configurationIndex];

		// set block size
		// because X509 certificate has a variable length need to compute the block size in two steps
		sizeOfBlock = offsetof(HAL_Configuration_X509CaRootBundle, Certificate);
		sizeOfBlock += ((HAL_Configuration_X509CaRootBundle*)blockAddress)->CertificateSize;
	}

