nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/targetHAL_ConfigurationManager.cpp
        // enumeration is required after we are DONE with SUCCESSFULLY storing all the config chunks
        requiresEnumeration = (result && done);
	}
	else
	{
		if (configuration == DeviceConfigurationOption_Network)
		{
			// set blob size
			blobSize = sizeof(HAL_Configuration_NetworkInterface);
		}
		else if (configuration == DeviceConfigurationOption_Wireless80211Network)
		{
			// set blob size
			blobSize = sizeof(HAL_Configuration_Wireless80211);
		}
		else if (configuration == DeviceConfigurationOption_WirelessNetworkAP)
		{
			// set blob size
			blobSize = sizeof(HAL_Configuration_WirelessAP);
		}
		else if (configuration == DeviceConfigurationOption_X509CaRootBundle)
		{
			// set blob size ( Total size of  X509 certificate )
			// because X509 certificate has a variable length need to compute the block size in two steps
			blobSize = offsetof(HAL_Configuration_X509CaRootBundle, Certificate);
			blobSize += ((HAL_Configuration_X509CaRootBundle*)configurationBlock)->CertificateSize;

	      #ifdef DEBUG_CONFIG
			ets_printf("StoreConfig x509 blobSize:%d, certsize:%d", blobSize, ((HAL_Configuration_X509CaRootBundle*)configurationBlock)->CertificateSize);
	      #endif
		}
		else
		{
			// Invalid Config
			return false;
		}
	}

	// Anything to save
	if (blobSize != 0)
	{
		result = StoreConfigBlock(configuration, configurationIndex, configurationBlock, blobSize);
	}

	if (requiresEnumeration)
	{
		// perform enumeration of configuration blocks
		ConfigurationManager_EnumerateConfigurationBlocks();
	}

#ifdef DEBUG_CONFIG
	ets_printf("StoreConfig exit %d", result);
#endif

	return result;
}

// Updates a configuration block in the configuration storage
bool ConfigurationManager_UpdateConfigurationBlock(void* configurationBlock, DeviceConfigurationOption configuration, uint32_t configurationIndex)
{
	// figure out the block size first
	uint32_t blockSize = 0;

	switch (configuration)
	{
		case DeviceConfigurationOption_Network:
			blockSize = sizeof(HAL_Configuration_NetworkInterface);
			break;

		case DeviceConfigurationOption_Wireless80211Network:
			blockSize = sizeof(HAL_Configuration_Wireless80211);
			break;

		case DeviceConfigurationOption_WirelessNetworkAP:
			blockSize = sizeof(HAL_Configuration_WirelessAP);
			break;

		case DeviceConfigurationOption_X509CaRootBundle:
			blockSize = offsetof(HAL_Configuration_X509CaRootBundle, Certificate);
			blockSize += ((HAL_Configuration_X509CaRootBundle*)configurationBlock)->CertificateSize;
			break;

		default:
			// shouldn't ever reach here
			return FALSE;
	}

	return ConfigurationManager_StoreConfigurationBlock(configurationBlock, configuration, configurationIndex, blockSize, 0, false);
}
